############################################################################
# i-Reporter
# 客先マスタの変換処理（EJがある間の一時的なもの）
# 作成 20240912
############################################################################
import pandas as pd
import shutil
import os
import csv
from datetime import datetime, timedelta, timezone
import numpy as np
import math

try:
  def conv():
    #客先マスター情報を取得（フルパス）
    df = pd.read_csv(r"\\Esrv06\帳票開発\EJData\M_CUST_U.csv",encoding='CP932',header=None)

    #スライスで抽出して、タイトル行をセット
    df = df.iloc[:,[0,1,2,3,7]]
    df.columns = ['客先コード','国コード','国名','客先名称','客先名称２']

    #旧Accessのクエリ１ Q_TOP_J
    #客先コードがJ始まり、またはE0005国名が空欄ではないデータを抽出　国名はJAPANに変更
    dfj1_1 = df[df['客先コード'].str.startswith('J')]
    dfj1_2 = df[df['客先コード'].str.startswith('E0005')]
    df1 = pd.concat([dfj1_1,dfj1_2], ignore_index=True)

    #国名欠損値および空白を削除
    df1 = df1.fillna('')
    mask = df1['国名']==''
    df1 = df1.loc[~mask,:]

    #客先名称２に国名をセット
    df1.loc[:,'客先名称２'] = df1['国名']

    #国名を付替え
    df1['国名']='JAPAN'

    #旧Accessのクエリ２ Q_TOP_NONJ
    #客先コードがJ始まりでなく、E0005でもない
    df2 = df[~df['客先コード'].str.startswith('J')]
    df2 = df2[~df2['客先コード'].str.startswith('E0005')]

    #客先名称２の欠損値および空白を削除
    df2 = df2.fillna('')
    mask = df2['客先名称２']==''
    df2 = df2.loc[~mask,:]

    #結合
    df3 = pd.concat([df1,df2], ignore_index=True)

    #旧Accessのクエリ３ 旧T_CHANGE_TABLE)
    #特定のマスターのみ、付け替え　これは基準がないのでベタ打ちのみ
    df3.loc[df3['客先コード'] == 'E0311','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E0511','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E0611','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E0712','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E0811','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E0911','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E1912','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E2212','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E3212','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'E4412','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'M0012','客先名称２'] = df3['客先名称']
    df3.loc[df3['客先コード'] == 'M0014','客先名称２'] = df3['客先名称']

    #取り込み用にデータを整える
    #取込用の前２列を追加
    df3.insert(0, 'アクション区分', 'M')
    df3.insert(0, 'H', 'R')

    #ソート　国番＞客先コード
    df3 = df3.sort_values(['国コード','客先コード']) 

    #表示順（連番）と、権限グループ（空欄）を追加
    df3['表示順'] = range(1, len(df3) + 1)
    df3['権限グループ'] =""

    #スライスする
    df3 = df3.iloc[:,[0,1,2,6,8,7,4,3]]
    df3.columns = ['0','1','2','3','4','5','6','7']
  
    #メモリ断片化リスク有りの警告が出る
    #df3 = df3.copy()
    #df3[['8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110']] = np.nan
    #↓メモリ断片化警告対応
    columns_to_add = ['8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110']
    new_columns = pd.DataFrame(np.nan, index=df3.index, columns=columns_to_add)
    df3 = pd.concat([df3, new_columns], axis=1)

    #ヘッダー部のdfを作成
    head = [["H","アクション区分","マスターキー","マスター名称","マスター種別","フィールド型配列","フィールド名称配列","画像フィールド名称配列","本体保存可否","ダウンロード区分","保持期間","有効期限","表示順","備考","レコードキーヘッダ名称","レコーバリューヘッダ名称","権限グループ","ラベルモード","ラベル","帳票定義ＩＤ","入力帳票ＩＤ"],
            ['M','M','M_CUSTOMER','客先マスタ','0','text;text;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;','国名;国コード;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;',';;;;','1','0','0','','1000','客先管理を行うマスタです','客先コード','客先名称','4;6;9;11','','チェックシートマスタ','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','',''],
            ['H','アクション区分','客先コード','客先名称','権限グループ','表示順','国名','国コード','フィールド0003','フィールド0004','フィールド0005','フィールド0006','フィールド0007','フィールド0008','フィールド0009','フィールド0010','フィールド0011','フィールド0012','フィールド0013','フィールド0014','フィールド0015','フィールド0016','フィールド0017','フィールド0018','フィールド0019','フィールド0020','フィールド0021','フィールド0022','フィールド0023','フィールド0024','フィールド0025','フィールド0026','フィールド0027','フィールド0028','フィールド0029','フィールド0030','フィールド0031','フィールド0032','フィールド0033','フィールド0034','フィールド0035','フィールド0036','フィールド0037','フィールド0038','フィールド0039','フィールド0040','フィールド0041','フィールド0042','フィールド0043','フィールド0044','フィールド0045','フィールド0046','フィールド0047','フィールド0048','フィールド0049','フィールド0050','フィールド0051','フィールド0052','フィールド0053','フィールド0054','フィールド0055','フィールド0056','フィールド0057','フィールド0058','フィールド0059','フィールド0060','フィールド0061','フィールド0062','フィールド0063','フィールド0064','フィールド0065','フィールド0066','フィールド0067','フィールド0068','フィールド0069','フィールド0070','フィールド0071','フィールド0072','フィールド0073','フィールド0074','フィールド0075','フィールド0076','フィールド0077','フィールド0078','フィールド0079','フィールド0080','フィールド0081','フィールド0082','フィールド0083','フィールド0084','フィールド0085','フィールド0086','フィールド0087','フィールド0088','フィールド0089','フィールド0090','フィールド0091','フィールド0092','フィールド0093','フィールド0094','フィールド0095','フィールド0096','フィールド0097','フィールド0098','フィールド0099','フィールド0100','フィールド1001','フィールド1002','フィールド1003','フィールド1004','フィールド1005']]
  
    df4 = pd.DataFrame(head)
    df4.columns = ['0','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110']

    #ヘッダー部と結合
    df5 = pd.concat([df4, df3], axis=0, ignore_index=True)

    #DFをcsvにコンバートして出力
    dt_now = datetime.now(timezone(timedelta(hours=9))) # 日本時刻
    csv_name = os.path.dirname(__file__)+"\\"+dt_now.strftime('%Y%m%d%H%M%S')+"_客先マスタデータ"+".csv"
    df5.to_csv(csv_name,index=False,encoding='CP932',header=False,quoting=csv.QUOTE_ALL)

    return(csv_name)


  def main():
    #タイムスタンプ比較
    f1_ts = math.floor(os.path.getmtime(r"\\Esrv06\帳票開発\EJData\M_CUST_U.csv"))
    f2_ts = math.floor(os.path.getmtime(os.path.dirname(__file__)+r"\\work\\M_CUST_U.csv"))

    #タイムスタンプに違いがあったら処理実行
    if f1_ts != f2_ts:
      csv_name = conv()
      #出来上がったcsvファイルをアップロードフォルダにMove
      shutil.move(csv_name,r"D:\CustomMaster\CSV_UPLOAD")
      #ファイルをコピーしてくる
      shutil.copy2(r"\\Esrv06\帳票開発\EJData\M_CUST_U.csv", os.path.dirname(__file__)+r"\\work\\M_CUST_U.csv")
  
  if __name__ == "__main__":
      main()

except Exception as e:
  #簡単なエラー処理
  print(e)
  dt_now = datetime.now(timezone(timedelta(hours=9))) # 日本時刻
  with open(os.path.dirname(__file__)+"\\"+dt_now.strftime('%Y%m%d%H%M%S')+"_err"+".txt", mode='w') as f:
    f.write(str(e))
